<a href="https://colab.research.google.com/github/PabloCaSan/Data-Science-Training/blob/main/Notebook4_ManipulandoDatos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Nota:** Para esta práctica hay que descargar un archivo csv de la NASA. Se puede encontrar en el siguiente [enlace](https://drive.google.com/drive/folders/13AsTOToO6kN2KDB4By57LFgFm-DTWO8i?usp=sharing)

Conectamos con nuestro Google Drive

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

Navegamos en Drive hasta la carpeta donde está guardada la base de datos

In [ ]:
%cd /content/drive/MyDrive/Platzi/db 
!ls

/content/drive/MyDrive/Platzi/db
Meteorite_Landings.csv	test.csv

Importamos las librerías

In [ ]:
import pandas as pd

Leemos los datos y guardamos la línea de código en una variable, para no tener que escribir todo a cada rato

In [ ]:
df_meteorites = pd.read_csv('Meteorite_Landings.csv')
df_meteorites

             name     id nametype  ...    reclat    reclong             GeoLocation
0          Aachen      1    Valid  ...  50.77500    6.08333       (50.775, 6.08333)
1          Aarhus      2    Valid  ...  56.18333   10.23333    (56.18333, 10.23333)
2            Abee      6    Valid  ...  54.21667 -113.00000      (54.21667, -113.0)
3        Acapulco     10    Valid  ...  16.88333  -99.90000       (16.88333, -99.9)
4         Achiras    370    Valid  ... -33.16667  -64.95000     (-33.16667, -64.95)
...           ...    ...      ...  ...       ...        ...                     ...
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[45716 rows x 10 columns]

Podemos explorar la base de datos mostrando solo los primeros cinco datos

In [ ]:
df_meteorites.head(5)

       name   id nametype  ...    reclat    reclong           GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775, 6.08333)
1    Aarhus    2    Valid  ...  56.18333   10.23333  (56.18333, 10.23333)
2      Abee    6    Valid  ...  54.21667 -113.00000    (54.21667, -113.0)
3  Acapulco   10    Valid  ...  16.88333  -99.90000     (16.88333, -99.9)
4   Achiras  370    Valid  ... -33.16667  -64.95000   (-33.16667, -64.95)

[5 rows x 10 columns]

Análogo a lo anterior, se pueden mostrar los últimos cinco datos

In [ ]:
df_meteorites.tail(5)

             name     id nametype  ...    reclat    reclong             GeoLocation
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[5 rows x 10 columns]

También se pueden tomar datos aleatorios dentro de la lista de datos

In [ ]:
df_meteorites.sample(5)

                        name     id  ...    reclong            GeoLocation
1307               Acfer 192    200  ...    4.20000           (27.65, 4.2)
9316           El Médano 087  56599  ...  -70.53333    (-24.85, -70.53333)
23875  Meteorite Hills 01182  16414  ...  159.75000    (-79.68333, 159.75)
36681           Sahara 99029  23041  ...        NaN                    NaN
16424             Hughes 007  11931  ...  129.63750  (-30.56833, 129.6375)

[5 rows x 10 columns]

Se pueden ver las dimensiones de la tabla de datos (como renglones, columnas)

In [ ]:
df_meteorites.shape

(45716, 10)

O la cantidad total de datos ( resultado de multiplicar columnas por renglones)

In [ ]:
df_meteorites.size

457160

Se puede extraer <u>información importante de los valores numéricos</u> de la tabla con la siguiente función:

In [ ]:
df_meteorites.describe()

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

Se puede modificar la manera en la que se presentan los valores numéricos, de la siguiente manera:

In [ ]:
pd.options.display.float_format = '{:,.1f}'.format

Donde la coma sirve para separar los miles (con comas), y el 1f para mostrar solo una cifra decimal (quita la notación científica). Lo anterior resulta en lo siguiente:

In [ ]:
df_meteorites.describe()

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

También se puede extraer <u>información importante de los valores numéricos y textuales</u> de la tabla con la siguiente función:

In [ ]:
df_meteorites.describe(include='all')

              name       id nametype  ...   reclat  reclong GeoLocation
count        45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique       45716      nan        2  ...      nan      nan       17100
top     Hope Creek      nan    Valid  ...      nan      nan  (0.0, 0.0)
freq             1      nan    45641  ...      nan      nan        6214
mean           NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std            NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min            NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%            NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%            NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%            NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max            NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

Para ver cuales son las categorías de las variables hacemos:

In [ ]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

Pandas también puede cambiar la categoría a la más adecuada, haciendo:

In [ ]:
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       float64
fall            string
year            string
reclat         float64
reclong        float64
GeoLocation     string
dtype: object

Se puede ver la variedad de los datos de la tabla

In [ ]:
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

Vemos que la variable *nametype* y la variable *fall*, solo tienen dos tipos. Si las analizamos más detalladamente...

In [ ]:
df_meteorites[['fall','nametype']]

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

Vemos que corresponden a valores binarios, es decir, del tipo sí/no, verdadero/falso, encontrado/perdido, etc. A este tipo de variables se les llama *categóricas* y se puede cambiar la categoría (tipo de variable) de la base de datos a una más adecuada:

In [ ]:
df_meteorites[['fall','nametype']].astype('category')

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

Para asegurarse de que lo anterior se aplique a la tabla hacemos:

In [ ]:
df_meteorites[['fall','nametype']] = df_meteorites[['fall','nametype']].astype('category')

Y comprobamos que el cambio se haya realizado

In [ ]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

Para ver el tipo de valores que recibe una categoría hacemos:

In [ ]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

Y para ver cuántas veces se repite cada valor hacemos:

In [ ]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

Podemos usar una variable "dummy" (*dummies* en plural) para convertir los valores binarios de la variable *category* a unos y ceros (pasan de variable tipo texto a variable numérica)

In [ ]:
pd.get_dummies(df_meteorites['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

Podemos agregar una nueva columna a la tabla, que contenga puros números unos, como:

```
df_meteorites['nueva'] = 1
```

Esto es importante, pues así podemos agregar las variables *dummies* a la tabla

In [ ]:
df_meteorites[['fell','found']] = pd.get_dummies(df_meteorites['fall'])
df_meteorites

             name     id nametype  ...             GeoLocation  fell found
0          Aachen      1    Valid  ...       (50.775, 6.08333)     1     0
1          Aarhus      2    Valid  ...    (56.18333, 10.23333)     1     0
2            Abee      6    Valid  ...      (54.21667, -113.0)     1     0
3        Acapulco     10    Valid  ...       (16.88333, -99.9)     1     0
4         Achiras    370    Valid  ...     (-33.16667, -64.95)     1     0
...           ...    ...      ...  ...                     ...   ...   ...
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[45716 rows x 12 columns]

Ahora pasamos a analizar la variable "year"

In [ ]:
df_meteorites['year']

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

Vemos que es una variable de tipo texto, lo cual no es muy últil, por lo que sería conveniente convertirla a una variable tipo tiempo. Para ello hacemos lo siguiente:

In [ ]:
pd.to_datetime(
  df_meteorites['year'], #la variable a convertir
  errors = 'coerce', #esto hace que cuando el formato del texto no corresponda al formato de tiempo (dd/mm/aaa, mm/dd/aaa, etc), devuelva una variable nula
  format ='%m/%d/%Y %H:%M:%S %p' #el formato de tiempo que tiene la variable original (%p es para AM/PM)
)

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

Sobreescribimos lo anterior a la tabla (lo anteior no modificó ningún dato de la tabla)

In [ ]:
df_meteorites['year'] = pd.to_datetime(
                          df_meteorites['year'], #la variable a convertir
                          errors = 'coerce', #esto hace que cuando el formato del texto no corresponda al formato de tiempo (dd/mm/aaa, mm/dd/aaa, etc), devuelva una variable nula
                          format ='%m/%d/%Y %H:%M:%S %p' #el formato de tiempo que tiene la variable original (%p es para AM/PM)
                          )

Comprobamos los cambios

In [ ]:
df_meteorites.convert_dtypes().dtypes

name                   string
id                      Int64
nametype             category
recclass               string
mass (g)              float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            string
fell                    UInt8
found                   UInt8
dtype: object

También se puede cambiar el nombre de las columnas

In [ ]:
df_meteorites.rename(columns={'name':'nombre'},inplace=True)

Comprobamos el cambio, para ello, una forma de obtener los nombres de las columnas es:

In [ ]:
list(df_meteorites)

['nombre',
 'id',
 'nametype',
 'recclass',
 'mass (g)',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation',
 'fell',
 'found']

Ahora vemos cómo borrar columnas, para ello primero creemos una:

In [ ]:
df_meteorites['unos']=1
df_meteorites

           nombre     id nametype  ... fell  found unos
0          Aachen      1    Valid  ...    1      0    1
1          Aarhus      2    Valid  ...    1      0    1
2            Abee      6    Valid  ...    1      0    1
3        Acapulco     10    Valid  ...    1      0    1
4         Achiras    370    Valid  ...    1      0    1
...           ...    ...      ...  ...  ...    ...  ...
45711  Zillah 002  31356    Valid  ...    0      1    1
45712      Zinder  30409    Valid  ...    0      1    1
45713        Zlin  30410    Valid  ...    0      1    1
45714   Zubkovsky  31357    Valid  ...    0      1    1
45715  Zulu Queen  30414    Valid  ...    0      1    1

[45716 rows x 13 columns]

La borramos con el comando:

In [ ]:
df_meteorites.drop(['unos'],axis=1, inplace=True) #axis sirve para elegir si se va a borrar una columna (1) o un renglón (0)
#inplace=True sirve para que los cambios se hagan a la tabla (el archivo csv)
df_meteorites

           nombre     id nametype  ...             GeoLocation  fell found
0          Aachen      1    Valid  ...       (50.775, 6.08333)     1     0
1          Aarhus      2    Valid  ...    (56.18333, 10.23333)     1     0
2            Abee      6    Valid  ...      (54.21667, -113.0)     1     0
3        Acapulco     10    Valid  ...       (16.88333, -99.9)     1     0
4         Achiras    370    Valid  ...     (-33.16667, -64.95)     1     0
...           ...    ...      ...  ...                     ...   ...   ...
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[45716 rows x 12 columns]

Para borrar renglones hacemos:

```
df_meteorites.drop([0,2,4,6,8]).head(10) #por defecto detecta que se quieren borra renglones
```

Para borrar columnas y renglones hacemos:


```
df_meteorites.drop(columns = ['id','nombre'], index = [0,2,4,6,8])
```

Por otro lado, para copiar una tabla hacemos:

In [ ]:
df = df_meteorites.copy(deep=True)
df

           nombre     id nametype  ...             GeoLocation  fell found
0          Aachen      1    Valid  ...       (50.775, 6.08333)     1     0
1          Aarhus      2    Valid  ...    (56.18333, 10.23333)     1     0
2            Abee      6    Valid  ...      (54.21667, -113.0)     1     0
3        Acapulco     10    Valid  ...       (16.88333, -99.9)     1     0
4         Achiras    370    Valid  ...     (-33.16667, -64.95)     1     0
...           ...    ...      ...  ...                     ...   ...   ...
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[45716 rows x 12 columns]

Es importante notar que se tiene que hace así, pues de lo contrario (no poner copy y solo hacer df = df_meteorites) los cambios realizados a la copia también se efectuarán a la original